//
//  KanaConstants.swift
//  SWIFTUI_KanjiStudy
//
//  Created by 이윤수 on 8/20/25.
//

import Foundation

struct KanaConstants {
    static let hiragana =  [
        ["あ", "い", "う", "え", "お"],
        ["か", "き", "く", "け", "こ"],
        ["さ", "し", "す", "せ", "そ"],
        ["た", "ち", "つ", "て", "と"],
        ["な", "に", "ぬ", "ね", "の"],
        ["は", "ひ", "ふ", "へ", "ほ"],
        ["ま", "み", "む", "め", "も"],
        ["や", "",  "ゆ", "", "よ"],
        ["ら", "り", "る", "れ", "ろ"],
        ["わ", "" , "を", "",  "ん"]
    ]
    
    static let katakana = [
        ["ア", "イ", "ウ", "エ", "オ"],
        ["カ", "キ", "ク", "ケ", "コ"],
        ["サ", "シ", "ス", "セ", "ソ"],
        ["タ", "チ", "ツ", "テ", "ト"],
        ["ナ", "ニ", "ヌ", "ネ", "ノ"],
        ["ハ", "ヒ", "フ", "ヘ", "ホ"],
        ["マ", "ミ", "ム", "メ", "モ"],
        ["ヤ", "", "ユ", "", "ヨ"],
        ["ラ", "リ", "ル", "レ", "ロ"],
        ["ワ", "", "ヲ", "", "ン"]
    ]
    
    static let pronunciations = [
        [("아", "a"), ("이", "i"), ("우", "u"), ("에", "e"), ("오", "o")],
        [("카", "ka"), ("키", "ki"), ("쿠", "ku"), ("케", "ke"), ("코", "ko")],
        [("사", "sa"), ("시", "shi"), ("스", "su"), ("세", "se"), ("소", "so")],
        [("타", "ta"), ("치", "chi"), ("츠", "tsu"), ("테", "te"), ("토", "to")],
        [("나", "na"), ("니", "ni"), ("누", "nu"), ("네", "ne"), ("노", "no")],
        [("하", "ha"), ("히", "hi"), ("후", "fu"), ("헤", "he"), ("호", "ho")],
        [("마", "ma"), ("미", "mi"), ("무", "mu"), ("메", "me"), ("모", "mo")],
        [("야", "ya"), ("", ""), ("유", "yu"), ("", ""), ("요", "yo")],
        [("라", "ra"), ("리", "ri"), ("루", "ru"), ("레", "re"), ("로", "ro")],
        [("와", "wa"), ("", ""), ("오", "wo"), ("", ""), ("ㄴ", "n")]
    ]
}
